rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Jack"]]
---
  def similar
    @movie, @movies, error = Movie.find_with_same_director(params[:id])